mock-example/src/test/resources/xml/FinRep/SrvGetFinReport/rs1.xml

<?xml version="1.0" encoding="UTF-8"?><soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:fin="http://sbrf.ru/NCP/ASFO/GetFinAnalysisRq/"/>
	<soap-env:Body xmlns:rs="http://sbrf.ru/NCP/ASFO/GetFinReportRs/" xmlns:rsd="http://sbrf.ru/NCP/ASFO/GetFinReport/Data" xmlns:rq="http://sbrf.ru/NCP/ASFO/GetFinReportRq/" xmlns:crm="http://sbrf.ru/NCP/ASFO/">
		<crm:getFinAnalysisRq>
			<rs:nonCurrentAssetsNFRS>1</rs:nonCurrentAssetsNFRS>
			<rs:currentAssetsNFRS>2</rs:currentAssetsNFRS>
			<rs:nonCurrentAssetsIFRS>3</rs:nonCurrentAssetsIFRS>
			<rs:currentAssetsIFRS>4</rs:currentAssetsIFRS>
			<rs:longTermDebtNFRS>5</rs:longTermDebtNFRS>
			<rs:shortTermDebtNFRS>6</rs:shortTermDebtNFRS>
			<rs:longTermDebtIFRS>7</rs:longTermDebtIFRS>
			<rs:shortTermDebtIFRS>8</rs:shortTermDebtIFRS>
			<rs:ebitdaNFRS>9</rs:ebitdaNFRS>
			<rs:numQuarterNFRS>10</rs:numQuarterNFRS>
			<rs:ebitdaIFRS>11</rs:ebitdaIFRS>
			<rs:numQuarterIFRS>12</rs:numQuarterIFRS>
			<rs:currencyCode>string12</rs:currencyCode>
			<rs:currencyCodeForFR>string13</rs:currencyCodeForFR>
			<rs:currencyRate>14</rs:currencyRate>
			<rs:futureCurrencyRate>15</rs:futureCurrencyRate>
			<rs:currentCurrencyRate>16</rs:currentCurrencyRate>
			<rs:purpose>string17</rs:purpose>
			<rs:currentYear>18</rs:currentYear>
			<rs:govDebt>19</rs:govDebt>
			<rs:creditGovDebt>20</rs:creditGovDebt>
			<rs:credit>21</rs:credit>
			<rs:liabilities>22</rs:liabilities>
			<rs:liabilitiesNextYear>23</rs:liabilitiesNextYear>
			<rs:income>24</rs:income>
			<rs:incomeNextYear>25</rs:incomeNextYear>
			<rs:plannedCredit>26</rs:plannedCredit>
			<rs:plannedCreditNextYear>27</rs:plannedCreditNextYear>
		</crm:getFinAnalysisRq>
	</soap-env:Body>
</soap-env:Envelope>
